{
  "ir_version": "1.0",
  "project": "release-agent",
  "repository": "https://github.com/grokify/release-agent",
  "releases": [
    {
      "version": "0.3.0",
      "date": "2026-01-12",
      "highlights": [
        { "description": "Complete transformation from pre-push validation tool to release automation platform with workflow engine, Claude Code integration, and multi-platform plugin support" }
      ],
      "added": [
        { "description": "CLI restructure with Cobra framework and 7 commands: `check`, `validate`, `release`, `changelog`, `readme`, `roadmap`, `version`" },
        { "description": "Release workflow engine with 9-step process: validate → check → changelog → commit → push → CI wait → tag" },
        { "description": "Comprehensive validation command with 4 areas: QA, Documentation, Release, Security" },
        { "description": "Team status report format (`--format team`) with template-based box output" },
        { "description": "Report package (`pkg/report`) with structured data types and text/template renderer" },
        { "description": "Actions framework with `Run()`, `Propose()`, `Apply()` pattern" },
        { "description": "ChangelogAction with schangelog integration" },
        { "description": "RoadmapAction with sroadmap integration" },
        { "description": "ReadmeAction for badge and version updates" },
        { "description": "Interactive mode with `--interactive` flag for Claude Code" },
        { "description": "JSON output mode with `--json` flag" },
        { "description": "TOON output format (Token-Oriented Object Notation) ~8x more token-efficient" },
        { "description": "Claude Code plugin with commands, skills, agents, and hooks" },
        { "description": "Gemini plugin support via platform adapters" },
        { "description": "SecurityChecker: LICENSE, govulncheck, dependency audit, secret detection" },
        { "description": "DocChecker: README, PRD, TRD, release notes, changelog validation" },
        { "description": "ReleaseChecker: version format, git status, CI configuration" },
        { "description": "Error handling compliance check (detects `_ = err` patterns)" },
        { "description": "Git wrapper package with tag, commit, push, status operations" },
        { "description": "CI status checking via gh CLI with WaitForCI support" },
        { "description": "GoReleaser configuration for multi-platform builds" },
        { "description": "Homebrew formula" }
      ],
      "changed": [
        { "description": "Module path from `github.com/grokify/prepush` to `github.com/grokify/release-agent`" },
        { "description": "Package structure from flat to `cmd/` and `pkg/` layout" },
        { "description": "Configuration file from `.prepush.yaml` to `.releaseagent.yaml`" }
      ],
      "documentation": [
        { "description": "Updated README with all new commands and features" },
        { "description": "Updated PRD with completed feature status" },
        { "description": "Updated TRD with new architecture and interfaces" },
        { "description": "Added release notes for v0.3.0" }
      ]
    },
    {
      "version": "0.2.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "Catch more issues locally with new `go build` and `go mod tidy` checks, plus soft warnings that inform without blocking" }
      ],
      "added": [
        { "description": "Go check: `go mod tidy` to verify go.mod/go.sum are up to date" },
        { "description": "Go check: `go build` to ensure project compiles" },
        { "description": "Go check: untracked references detection (soft warning)" },
        { "description": "Soft warnings system: checks that report issues but don't fail the build" },
        { "description": "Git hook setup instructions with three options (script, symlink, shared hooks)" }
      ],
      "fixed": [
        { "description": "Directory walking now correctly handles current directory (`.`)" }
      ],
      "documentation": [
        { "description": "Expanded README with git hook setup options and bypass instructions" },
        { "description": "Added Go checks detail table documenting hard vs soft checks" },
        { "description": "Updated example output to show all 7 checks including warnings" }
      ]
    },
    {
      "version": "0.1.0",
      "date": "2026-01-04",
      "highlights": [
        { "description": "One command to run all pre-push checks across Go, TypeScript, and JavaScript - with auto-detection and monorepo support" }
      ],
      "added": [
        { "description": "Multi-language pre-push hook with auto-detection" },
        { "description": "Go checks: `gofmt`, `golangci-lint`, `go test`, local replace directive detection" },
        { "description": "TypeScript/JavaScript checks: `eslint`, `prettier`, `tsc --noEmit`, `npm test`" },
        { "description": "Language detection for Go, TypeScript, JavaScript, Python, Rust, Swift" },
        { "description": "Monorepo support with multiple language detection per repository" },
        { "description": "Configuration via `.prepush.yaml` with per-language settings" },
        { "description": "CLI flags: `--verbose`, `--no-test`, `--no-lint`, `--no-format`, `--coverage`" }
      ],
      "documentation": [
        { "description": "README with installation, usage, and configuration examples" }
      ],
      "tests": [
        { "description": "Unit tests for detect, config, and checks packages" }
      ]
    }
  ]
}
